MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAR176/mcu.h
#define _USBLMPR2_LPMFADDR_POSITION              0x00000008
#define _USBLMPR2_LPMFADDR_MASK                  0x00007F00
#define _USBLMPR2_LPMFADDR_LENGTH                0x00000007

#define _USBLPMP2_LPMST_POSITION                 0x00000000
#define _USBLPMP2_LPMST_MASK                     0x00000001
#define _USBLPMP2_LPMST_LENGTH                   0x00000001

#define _USBLPMP2_LPMNY_POSITION                 0x00000001
#define _USBLPMP2_LPMNY_MASK                     0x00000002
#define _USBLPMP2_LPMNY_LENGTH                   0x00000001

#define _USBLPMP2_LPMACK_POSITION                0x00000002
#define _USBLPMP2_LPMACK_MASK                    0x00000004
#define _USBLPMP2_LPMACK_LENGTH                  0x00000001

#define _USBLPMP2_LPMNC_POSITION                 0x00000003
#define _USBLPMP2_LPMNC_MASK                     0x00000008
#define _USBLPMP2_LPMNC_LENGTH                   0x00000001

#define _USBLPMP2_LPMRES_POSITION                0x00000004
#define _USBLPMP2_LPMRES_MASK                    0x00000010
#define _USBLPMP2_LPMRES_LENGTH                  0x00000001

#define _USBLPMP2_LPMERR_POSITION                0x00000005
#define _USBLPMP2_LPMERR_MASK                    0x00000020
#define _USBLPMP2_LPMERR_LENGTH                  0x00000001

#define _USBLPMP2_LPMFADDR_POSITION              0x00000008
#define _USBLPMP2_LPMFADDR_MASK                  0x00007F00
#define _USBLPMP2_LPMFADDR_LENGTH                0x00000007

#define _RNGVER_REVISION_POSITION                0x00000000
#define _RNGVER_REVISION_MASK                    0x0000007F
#define _RNGVER_REVISION_LENGTH                  0x00000007

#define _RNGVER_VERSION_POSITION                 0x00000007
#define _RNGVER_VERSION_MASK                     0x0000FF80
#define _RNGVER_VERSION_LENGTH                   0x00000009

#define _RNGVER_ID_POSITION                      0x00000010
#define _RNGVER_ID_MASK                          0xFFFF0000
#define _RNGVER_ID_LENGTH                        0x00000010

#define _RNGCON_PLEN_POSITION                    0x00000000
#define _RNGCON_PLEN_MASK                        0x000000FF
#define _RNGCON_PLEN_LENGTH                      0x00000008

#define _RNGCON_TRNGEN_POSITION                  0x00000008
#define _RNGCON_TRNGEN_MASK                      0x00000100
#define _RNGCON_TRNGEN_LENGTH                    0x00000001

#define _RNGCON_PRNGEN_POSITION                  0x00000009
#define _RNGCON_PRNGEN_MASK                      0x00000200
#define _RNGCON_PRNGEN_LENGTH                    0x00000001

#define _RNGCON_CONT_POSITION                    0x0000000A
#define _RNGCON_CONT_MASK                        0x00000400
#define _RNGCON_CONT_LENGTH                      0x00000001

#define _RNGCON_TRNGMODE_POSITION                0x0000000B
#define _RNGCON_TRNGMODE_MASK                    0x00000800
#define _RNGCON_TRNGMODE_LENGTH                  0x00000001

#define _RNGCON_LOAD_POSITION                    0x0000000C
#define _RNGCON_LOAD_MASK                        0x00001000
#define _RNGCON_LOAD_LENGTH                      0x00000001

#define _RNGPOLY1_POLY_POSITION                  0x00000000
#define _RNGPOLY1_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY1_POLY_LENGTH                    0x00000020

#define _RNGPOLY2_POLY_POSITION                  0x00000000
#define _RNGPOLY2_POLY_MASK                      0xFFFFFFFF
#define _RNGPOLY2_POLY_LENGTH                    0x00000020

#define _RNGNUMGEN1_RNG_POSITION                 0x00000000
#define _RNGNUMGEN1_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN1_RNG_LENGTH                   0x00000020

#define _RNGNUMGEN2_RNG_POSITION                 0x00000000
#define _RNGNUMGEN2_RNG_MASK                     0xFFFFFFFF
#define _RNGNUMGEN2_RNG_LENGTH                   0x00000020

#define _RNGSEED1_SEED_POSITION                  0x00000000
#define _RNGSEED1_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED1_SEED_LENGTH                    0x00000020

#define _RNGSEED2_SEED_POSITION                  0x00000000
#define _RNGSEED2_SEED_MASK                      0xFFFFFFFF
#define _RNGSEED2_SEED_LENGTH                    0x00000020

#define _RNGCNT_RCNT_POSITION                    0x00000000
#define _RNGCNT_RCNT_MASK                        0x0000007F
#define _RNGCNT_RCNT_LENGTH                      0x00000007

#define _DDRTSEL_TSEL_POSITION                   0x00000000
#define _DDRTSEL_TSEL_MASK                       0x000000FF
#define _DDRTSEL_TSEL_LENGTH                     0x00000008

#define _DDRMINLIM_MINLIMIT_POSITION             0x00000000
#define _DDRMINLIM_MINLIMIT_MASK                 0x0000001F
#define _DDRMINLIM_MINLIMIT_LENGTH               0x00000005

#define _DDRRQPER_RQPER_POSITION                 0x00000000
#define _DDRRQPER_RQPER_MASK                     0x000000FF
#define _DDRRQPER_RQPER_LENGTH                   0x00000008

#define _DDRMINCMD_MINCMD_POSITION               0x00000000
#define _DDRMINCMD_MINCMD_MASK                   0x000000FF
#define _DDRMINCMD_MINCMD_LENGTH                 0x00000008

#define _DDRMEMCON_STINIT_POSITION               0x00000000
#define _DDRMEMCON_STINIT_MASK                   0x00000001
#define _DDRMEMCON_STINIT_LENGTH                 0x00000001

#define _DDRMEMCON_INITDN_POSITION               0x00000001
#define _DDRMEMCON_INITDN_MASK                   0x00000002
#define _DDRMEMCON_INITDN_LENGTH                 0x00000001

#define _DDRMEMCFG0_RWADDR_POSITION              0x00000000
#define _DDRMEMCFG0_RWADDR_MASK                  0x0000001F
#define _DDRMEMCFG0_RWADDR_LENGTH                0x00000005

#define _DDRMEMCFG0_BNKADDR_POSITION             0x00000008
#define _DDRMEMCFG0_BNKADDR_MASK                 0x00001F00
#define _DDRMEMCFG0_BNKADDR_LENGTH               0x00000005

#define _DDRMEMCFG0_CSADDR_POSITION              0x00000010
#define _DDRMEMCFG0_CSADDR_MASK                  0x001F0000
#define _DDRMEMCFG0_CSADDR_LENGTH                0x00000005

#define _DDRMEMCFG0_CLHADDR_POSITION             0x00000018
#define _DDRMEMCFG0_CLHADDR_MASK                 0x1F000000
#define _DDRMEMCFG0_CLHADDR_LENGTH               0x00000005

#define _DDRMEMCFG0_APCHRGEN_POSITION            0x0000001E
#define _DDRMEMCFG0_APCHRGEN_MASK                0x40000000
#define _DDRMEMCFG0_APCHRGEN_LENGTH              0x00000001

