MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAR176/mcu.h
#define _DDRSCLCFG1_WCASLAT_POSITION             0x00000008
#define _DDRSCLCFG1_WCASLAT_MASK                 0x00000F00
#define _DDRSCLCFG1_WCASLAT_LENGTH               0x00000004

#define _DDRSCLCFG1_DBLREFDLY_POSITION           0x0000000C
#define _DDRSCLCFG1_DBLREFDLY_MASK               0x00001000
#define _DDRSCLCFG1_DBLREFDLY_LENGTH             0x00000001

#define _DDRPHYPADCON_ODTSEL_POSITION            0x00000000
#define _DDRPHYPADCON_ODTSEL_MASK                0x00000001
#define _DDRPHYPADCON_ODTSEL_LENGTH              0x00000001

#define _DDRPHYPADCON_ODTEN_POSITION             0x00000001
#define _DDRPHYPADCON_ODTEN_MASK                 0x00000002
#define _DDRPHYPADCON_ODTEN_LENGTH               0x00000001

#define _DDRPHYPADCON_DATDRVSEL_POSITION         0x00000002
#define _DDRPHYPADCON_DATDRVSEL_MASK             0x00000004
#define _DDRPHYPADCON_DATDRVSEL_LENGTH           0x00000001

#define _DDRPHYPADCON_ADDCDRVSEL_POSITION        0x00000003
#define _DDRPHYPADCON_ADDCDRVSEL_MASK            0x00000008
#define _DDRPHYPADCON_ADDCDRVSEL_LENGTH          0x00000001

#define _DDRPHYPADCON_ODTPDCAL_POSITION          0x00000004
#define _DDRPHYPADCON_ODTPDCAL_MASK              0x00000030
#define _DDRPHYPADCON_ODTPDCAL_LENGTH            0x00000002

#define _DDRPHYPADCON_ODTPUCAL_POSITION          0x00000006
#define _DDRPHYPADCON_ODTPUCAL_MASK              0x000000C0
#define _DDRPHYPADCON_ODTPUCAL_LENGTH            0x00000002

#define _DDRPHYPADCON_EOENCLKCYC_POSITION        0x00000008
#define _DDRPHYPADCON_EOENCLKCYC_MASK            0x00000100
#define _DDRPHYPADCON_EOENCLKCYC_LENGTH          0x00000001

#define _DDRPHYPADCON_NOEXTDLL_POSITION          0x00000009
#define _DDRPHYPADCON_NOEXTDLL_MASK              0x00000200
#define _DDRPHYPADCON_NOEXTDLL_LENGTH            0x00000001

#define _DDRPHYPADCON_WRCMDDLY_POSITION          0x0000000D
#define _DDRPHYPADCON_WRCMDDLY_MASK              0x00002000
#define _DDRPHYPADCON_WRCMDDLY_LENGTH            0x00000001

#define _DDRPHYPADCON_HALFRATE_POSITION          0x0000000E
#define _DDRPHYPADCON_HALFRATE_MASK              0x00004000
#define _DDRPHYPADCON_HALFRATE_LENGTH            0x00000001

#define _DDRPHYPADCON_DRVSTRNFET_POSITION        0x00000010
#define _DDRPHYPADCON_DRVSTRNFET_MASK            0x000F0000
#define _DDRPHYPADCON_DRVSTRNFET_LENGTH          0x00000004

#define _DDRPHYPADCON_DRVSTRPFET_POSITION        0x00000014
#define _DDRPHYPADCON_DRVSTRPFET_MASK            0x00F00000
#define _DDRPHYPADCON_DRVSTRPFET_LENGTH          0x00000004

#define _DDRPHYPADCON_RCVREN_POSITION            0x0000001C
#define _DDRPHYPADCON_RCVREN_MASK                0x10000000
#define _DDRPHYPADCON_RCVREN_LENGTH              0x00000001

#define _DDRPHYPADCON_PREAMBDLY_POSITION         0x0000001D
#define _DDRPHYPADCON_PREAMBDLY_MASK             0x60000000
#define _DDRPHYPADCON_PREAMBDLY_LENGTH           0x00000002

#define _DDRPHYDLLR_RECALIBCNT_POSITION          0x00000008
#define _DDRPHYDLLR_RECALIBCNT_MASK              0x03FFFF00
#define _DDRPHYDLLR_RECALIBCNT_LENGTH            0x00000012

#define _DDRPHYDLLR_DISRECALIB_POSITION          0x0000001A
#define _DDRPHYDLLR_DISRECALIB_MASK              0x04000000
#define _DDRPHYDLLR_DISRECALIB_LENGTH            0x00000001

#define _DDRPHYDLLR_DLYSTVAL_POSITION            0x0000001C
#define _DDRPHYDLLR_DLYSTVAL_MASK                0xF0000000
#define _DDRPHYDLLR_DLYSTVAL_LENGTH              0x00000004

#define _DDRPHYDLLCTRL_DDRDLLTRIM_POSITION       0x00000000
#define _DDRPHYDLLCTRL_DDRDLLTRIM_MASK           0x000000FF
#define _DDRPHYDLLCTRL_DDRDLLTRIM_LENGTH         0x00000008

#define _DDRPHYCLKDLY_CLKDLYDELTA_POSITION       0x00000000
#define _DDRPHYCLKDLY_CLKDLYDELTA_MASK           0x00000007
#define _DDRPHYCLKDLY_CLKDLYDELTA_LENGTH         0x00000003

#define _DDRPHYCLKDLY_SCLLBPASS_POSITION         0x00000004
#define _DDRPHYCLKDLY_SCLLBPASS_MASK             0x00000010
#define _DDRPHYCLKDLY_SCLLBPASS_LENGTH           0x00000001

#define _DDRPHYCLKDLY_SCLUBPASS_POSITION         0x00000005
#define _DDRPHYCLKDLY_SCLUBPASS_MASK             0x00000020
#define _DDRPHYCLKDLY_SCLUBPASS_LENGTH           0x00000001

#define _DDRADLLBYP_ANLDLLBYP_POSITION           0x00000018
#define _DDRADLLBYP_ANLDLLBYP_MASK               0x01000000
#define _DDRADLLBYP_ANLDLLBYP_LENGTH             0x00000001

#define _DDRSCLCFG2_SCLLANSEL_POSITION           0x00000000
#define _DDRSCLCFG2_SCLLANSEL_MASK               0x00000003
#define _DDRSCLCFG2_SCLLANSEL_LENGTH             0x00000002

#define _DDRPHYSCLADR_SCLROWADR_POSITION         0x00000000
#define _DDRPHYSCLADR_SCLROWADR_MASK             0x0000FFFF
#define _DDRPHYSCLADR_SCLROWADR_LENGTH           0x00000010

#define _DDRPHYSCLADR_SCLCOLADR_POSITION         0x00000010
#define _DDRPHYSCLADR_SCLCOLADR_MASK             0x1FFF0000
#define _DDRPHYSCLADR_SCLCOLADR_LENGTH           0x0000000D

#define _DDRPHYSCLADR_SCLBANKADR_POSITION        0x0000001D
#define _DDRPHYSCLADR_SCLBANKADR_MASK            0xE0000000
#define _DDRPHYSCLADR_SCLBANKADR_LENGTH          0x00000003

#define _GLCDMODE_RGBSEQ_POSITION                0x00000005
#define _GLCDMODE_RGBSEQ_MASK                    0x000000E0
#define _GLCDMODE_RGBSEQ_LENGTH                  0x00000003

#define _GLCDMODE_FORMATCLK_POSITION             0x00000008
#define _GLCDMODE_FORMATCLK_MASK                 0x00000100
#define _GLCDMODE_FORMATCLK_LENGTH               0x00000001

#define _GLCDMODE_YUVOUTPUT_POSITION             0x00000009
#define _GLCDMODE_YUVOUTPUT_MASK                 0x00000200
#define _GLCDMODE_YUVOUTPUT_LENGTH               0x00000001

#define _GLCDMODE_FORCEBLANK_POSITION            0x00000013
#define _GLCDMODE_FORCEBLANK_MASK                0x00080000
#define _GLCDMODE_FORCEBLANK_LENGTH              0x00000001

#define _GLCDMODE_PGRAMPEN_POSITION              0x00000014
#define _GLCDMODE_PGRAMPEN_MASK                  0x00100000
#define _GLCDMODE_PGRAMPEN_LENGTH                0x00000001

#define _GLCDMODE_PCLKPOL_POSITION               0x00000016
#define _GLCDMODE_PCLKPOL_MASK                   0x00400000
#define _GLCDMODE_PCLKPOL_LENGTH                 0x00000001

#define _GLCDMODE_VSYNCCYC_POSITION              0x00000017
#define _GLCDMODE_VSYNCCYC_MASK                  0x00800000
#define _GLCDMODE_VSYNCCYC_LENGTH                0x00000001

#define _GLCDMODE_DITHER_POSITION                0x00000018
#define _GLCDMODE_DITHER_MASK                    0x01000000
#define _GLCDMODE_DITHER_LENGTH                  0x00000001

